{
    "promotions": [
        {
            "id": 9001, "type": "MULTI_HARRY", "name": "Buy multiple harry potter volume", "targetIds": [10001, 10002, 10003, 10004, 10005, 10006, 10007], "discounts": ["10.00", "11.00", "12.00", "13.00", "14.00", "15.00"]
        },
        {
            "id": 9002, "type": "4_FREE_1", "name": "Buy 4 free 1", "targetIds": [10008, 10009, 10010, 10011, 10012, 10013, 10014], "detail": [{ "MIN_BUY": 4, "FREE": 1 }]
        }
    ],
    "books": [
        { 
            "id": 10001, "title": "Harry Potter and the Philosopher's Stone", "author": "J. K. Rowling", "price": "1300.00", "description": "Prepare to be spellbound by Jim Kay's dazzling depiction of the wizarding world and much loved characters in this full-colour illustrated hardback edition of the nation's favourite children's book - Harry Potter and the Philosopher's Stone. Brimming with rich detail and humour that perfectly complements J.K. Rowling's timeless classic, Jim Kay's glorious illustrations will captivate fans and new readers alike. \nWhen a letter arrives for unhappy but ordinary Harry Potter, a decade-old secret is revealed to him that apparently he's the last to know. His parents were wizards, killed by a Dark Lord's curse when Harry was just a baby, and which he somehow survived. Leaving his unsympathetic aunt and uncle for Hogwarts School of Witchcraft and Wizardry, Harry stumbles upon a sinister mystery when he finds a three-headed dog guarding a room on the third floor. Then he hears of a missing stone with astonishing powers, which could be valuable, dangerous - or both. An incredible adventure is about to begin!" ,
            "images": {
                "jpeg": "https://vos.line-scdn.net/assignment/book-shop/jpeg/harry-1.jpeg",
                "avif": "https://vos.line-scdn.net/assignment/book-shop/avif/harry-1.avif",
                "webp": "https://vos.line-scdn.net/assignment/book-shop/webp/harry-1.webp"
            }
        },
        { 
            "id": 10002, "title": "Harry Potter and the Chamber of Secrets", "author": "J. K. Rowling", "price": "355.00", "description": "Harry Potter's summer has included the worst birthday ever, doomy warnings from a house-elf called Dobby, and rescue from the Dursleys by his friend Ron Weasley in a magical flying car! Back at Hogwarts School of Witchcraft and Wizardry for his second year, Harry hears strange whispers echo through empty corridors - and then the attacks start. Students are found as though turned to stone ... Dobby's sinister predictions seem to be coming true.\nThese new editions of the classic and internationally bestselling, multi-award-winning series feature instantly pick-up-able new jackets by Jonny Duddle, with huge child appeal, to bring Harry Potter to the next generation of readers. It's time to PASS THE MAGIC ON .." ,
            "images": {
                "jpeg": "https://vos.line-scdn.net/assignment/book-shop/jpeg/harry-2.jpeg",
                "avif": "https://vos.line-scdn.net/assignment/book-shop/avif/harry-2.avif",
                "webp": "https://vos.line-scdn.net/assignment/book-shop/webp/harry-2.webp"
            }
        },
        { 
            "id": 10003, "title": "Harry Potter and the Prisoner of Azkaban", "author": "J. K. Rowling", "price": "480.50", "description": "For twelve long years, the dread fortress of Azkaban held an infamous prisoner named Sirius Black. Convicted of killing thirteen people with a single curse, he was said to be the heir apparent to the Dark Lord, Voldemort.Now he has escaped, leaving only two clues as to where he might be headed: Harry Potter's defeat of You-Know-Who was Black's downfall as well. And the Azkaban guards heard Black muttering in his sleep, He's at Hogwarts . . . he's at Hogwarts.Harry Potter isn't safe, not even within the walls of his magical school, surrounded by his friends. Because on top of it all, there may well be a traitor in their midst." ,
            "images": {
                "jpeg": "https://vos.line-scdn.net/assignment/book-shop/jpeg/harry-3.jpeg",
                "avif": "https://vos.line-scdn.net/assignment/book-shop/avif/harry-3.avif",
                "webp": "https://vos.line-scdn.net/assignment/book-shop/webp/harry-3.webp"
            }
        },
        { 
            "id": 10004, "title": "Harry Potter and the Goblet of Fire", "author": "J. K. Rowling", "price": "500.00", "description": "The paperback edition of the legendary, record-breaking, best-selling fourth Harry Potter novel.\nHarry Potter is midway through his training as a wizard and his coming of age. Harry wants to get away from the pernicious Dursleys and go to the International Quidditch Cup. He wants to find out about the mysterious event that's supposed to take place at Hogwarts this year, an event involving two other rival schools of magic, and a competition that hasn't happened for a hundred years. He wants to be a normal, fourteen-year-old wizard. But unfortunately for Harry Potter, he's not normal - even by wizarding standards. And in his case, different can be deadly." ,
            "images": {
                "jpeg": "https://vos.line-scdn.net/assignment/book-shop/jpeg/harry-4.jpeg",
                "avif": "https://vos.line-scdn.net/assignment/book-shop/avif/harry-4.avif",
                "webp": "https://vos.line-scdn.net/assignment/book-shop/webp/harry-4.webp"
            }
        },
        { 
            "id": 10005, "title": "Harry Potter and the Order of the Phoenix", "author": "J. K. Rowling", "price": "530.00", "description": "The most eagerly anticipated book in history becomes the biggest paperback release of 2004!\nThe book that took the world by storm....In his fifth year at Hogwart's, Harry faces challenges at every turn, from the dark threat of He-Who-Must-Not-Be- Named and the unreliability of the government of the magical world to the rise of Ron Weasley as the keeper of the Gryffindor Quidditch Team. Along the way he learns about the strength of his friends, the fierceness of his enemies, and the meaning of sacrifice." ,
            "images": {
                "jpeg": "https://vos.line-scdn.net/assignment/book-shop/jpeg/harry-5.jpeg",
                "avif": "https://vos.line-scdn.net/assignment/book-shop/avif/harry-5.avif",
                "webp": "https://vos.line-scdn.net/assignment/book-shop/webp/harry-5.webp"
            }
        },
        { 
            "id": 10006, "title": "Harry Potter and the Half-Blood Prince", "author": "J. K. Rowling", "price": "430.00", "description": "When Dumbledore arrives at Privet Drive one summer night to collect Harry Potter, his wand hand is blackened and shrivelled, but he does not reveal why. Secrets and suspicion are spreading through the wizarding world, and Hogwarts itself is not safe. Harry is convinced that Malfoy bears the Dark Mark: there is a Death Eater amongst them. Harry will need powerful magic and true friends as he explores Voldemort's darkest secrets, and Dumbledore prepares him to face his destiny.\nThese new editions of the classic and internationally bestselling, multi-award-winning series feature instantly pick-up-able new jackets by Jonny Duddle, with huge child appeal, to bring Harry Potter to the next generation of readers. It's time to PASS THE MAGIC ON ...",
            "images": {
                "jpeg": "https://vos.line-scdn.net/assignment/book-shop/jpeg/harry-6.jpeg",
                "avif": "https://vos.line-scdn.net/assignment/book-shop/avif/harry-6.avif",
                "webp": "https://vos.line-scdn.net/assignment/book-shop/webp/harry-6.webp"
            }
        },
        { 
            "id": 10007, "title": "Harry Potter and the Deathly Hallows", "author": "J. K. Rowling", "price": "444.33", "description": "As he climbs into the sidecar of Hagrid's motorbike and takes to the skies, leaving Privet Drive for the last time, Harry Potter knows that Lord Voldemort and the Death Eaters are not far behind. The protective charm that has kept Harry safe until now is now broken, but he cannot keep hiding. The Dark Lord is breathing fear into everything Harry loves, and to stop him Harry will have to find and destroy the remaining Horcruxes. The final battle must begin - Harry must stand and face his enemy.\nThese new editions of the classic and internationally bestselling, multi-award-winning series feature instantly pick-up-able new jackets by Jonny Duddle, with huge child appeal, to bring Harry Potter to the next generation of readers. It's time to PASS THE MAGIC ON ...",
            "images": {
                "jpeg": "https://vos.line-scdn.net/assignment/book-shop/jpeg/harry-7.jpeg",
                "avif": "https://vos.line-scdn.net/assignment/book-shop/avif/harry-7.avif",
                "webp": "https://vos.line-scdn.net/assignment/book-shop/webp/harry-7.webp"
            }
        },
        { 
            "id": 10008, "title": "A Wild Sheep Chase", "author": "Haruki Murakami", "price": "391.00", "description": "A marvelous hybrid of mythology and mystery, A Wild Sheep Chase is the extraordinary literary thriller that launched Haruki Murakami's international reputation.\nIt begins simply enough: A twenty-something advertising executive receives a postcard from a friend, and casually appropriates the image for an insurance company's advertisement. What he doesn't realise is that included in the pastoral scene is a mutant sheep with a star on its back, and in using this photo he has unwittingly captured the attention of a man in black who offers a menacing ultimatum: find the sheep or face dire consequences. Thus begins a surreal and elaborate quest that takes our hero from the urban haunts of Tokyo to the remote and snowy mountains of northern Japan, where he confronts not only the mythological sheep, but the confines of tradition and the demons deep within himself. Quirky and utterly captivating, A Wild Sheep Chase is Murakami at his astounding best.\n'A Wild Sheep Chase has the conventional hull of a thriller - a quest, a mystery, an extraordinary woman, and plenty of elegant duress - but its fantastic superstructure transforms it into something quite different...a science fiction fantasy, a romance, a metaphysical tease, or a dramatisation of philosophical ideas' Independent",
            "images": {
                "jpeg": "https://vos.line-scdn.net/assignment/book-shop/jpeg/A%20wild%20sheep%20chase.jpeg",
                "avif": "https://vos.line-scdn.net/assignment/book-shop/avif/A%20wild%20sheep%20chase.avif",
                "webp": "https://vos.line-scdn.net/assignment/book-shop/webp/A%20wild%20sheep%20chase.webp"
            }
        },
        { 
            "id": 10009, "title": "Coraline", "author": "Neil Gaiman", "price": "324.76", "description": "The bewitching tenth-anniversary edition of the classic children's novel Coraline by Neil Gaiman, featuring spellbinding illustrations from Chris Riddell and an exclusive new introduction by the author",
            "images": {
                "jpeg": "https://vos.line-scdn.net/assignment/book-shop/jpeg/coraline.jpeg",
                "avif": "https://vos.line-scdn.net/assignment/book-shop/avif/coraline.avif",
                "webp": "https://vos.line-scdn.net/assignment/book-shop/webp/coraline.webp"
            }
        },
        { 
            "id": 10010, "title": "Kafka on the Shore", "author": "Haruki Murakami", "price": "454.04", "description": "Kafka on the Shore follows the fortunes of two remarkable characters. Kafka Tamura runs away from home at fifteen, under the shadow of his father's dark prophesy. The aging Nakata, tracker of lost cats, who never recovered from a bizarre childhood affliction, finds his pleasantly simplified life suddenly turned upside down. Their parallel odysseys are enriched throughout by vivid accomplices and mesmerising dramas. Cats converse with people; fish tumble from the sky; a ghostlike pimp deploys a Hegel-spouting girl of the night; a forest harbours soldiers apparently un-aged since WWII. There is a savage killing, but the identity of both victim and killer is a riddle. Murakami's new novel is at once a classic tale of quest, but it is also a bold exploration of mythic and contemporary taboos, of patricide, of mother-love, of sister-love. Above all it is an entertainment of a very high order.",
            "images": {
                "jpeg": "https://vos.line-scdn.net/assignment/book-shop/jpeg/Kafka-on-the-Shore.jpeg",
                "avif": "https://vos.line-scdn.net/assignment/book-shop/avif/Kafka-on-the-Shore.avif",
                "webp": "https://vos.line-scdn.net/assignment/book-shop/webp/Kafka-on-the-Shore.webp"
            }
        },
        { 
            "id": 10011, "title": "The Borrowers", "author": "Mary Norton", "price": "298.87", "description": "A enchanting and enduring children's classic, The Borrowers is the award-winning tale of three tiny people who are big heroes.\nThe Clock family--Homily, Pod, and their fourteen-year-old daughter, Arrietty--are tiny people who live underneath the kitchen floor of an English manor. All their minuscule home furnishings, from postage stamp paintings to champagne cork chairs, are \"borrowed\" from the \"human beans\" who tromp around loudly above them. All is well until Pod is spotted upstairs by a human boy! Can the Clocks stay nested safely in their beloved hidden home, or will they be forced to flee?",
            "images": {
                "jpeg": "https://vos.line-scdn.net/assignment/book-shop/jpeg/the%20borrowers.jpeg",
                "avif": "https://vos.line-scdn.net/assignment/book-shop/avif/the%20borrowers.avif",
                "webp": "https://vos.line-scdn.net/assignment/book-shop/webp/the%20borrowers.webp"
            }
        },
        { 
            "id": 10012, "title": "The Magic Finger", "author": "Roald Dahl", "price": "272.41", "description": "From the bestselling author of Charlie and the Chocolate Factory and The BFG comes the story of a young girl with an incredible power!\nTo the Gregg family, hunting is just plain fun. To the girl who lives next door, it's just plain horrible. She tries to be polite. She tries to talk them out of it, but the Greggs only laugh at her. Then one day the Greggs go too far, and the little girl turns her Magic Finger on them. When she's very, very angry, the little girl's Magic Finger takes over. She really can't control it, and now it's turned the Greggs into birds! Before they know it, the Greggs are living in a nest, and that's just the beginning of their problems...",
            "images": {
                "jpeg": "https://vos.line-scdn.net/assignment/book-shop/jpeg/the%20magic%20finger.jpeg",
                "avif": "https://vos.line-scdn.net/assignment/book-shop/avif/the%20magic%20finger.avif",
                "webp": "https://vos.line-scdn.net/assignment/book-shop/webp/the%20magic%20finger.webp"
            }
        },
        { 
            "id": 10013, "title": "The Alchemist", "author": "Paulo Coelho", "price": "308.30", "description": "The 25th Anniversary Edition of the beloved novel!\nSantiago, a young shepherd living in the hills of Andalucia, feels that there is more to life than his humble home and his flock. One day he finds the courage to follow his dreams into distant lands, each step galvanised by the knowledge that he is following the right path: his own. The people he meets along the way, the things he sees and the wisdom he learns are life-changing.",
            "images": {
                "jpeg": "https://vos.line-scdn.net/assignment/book-shop/jpeg/the-alchemist.jpeg",
                "avif": "https://vos.line-scdn.net/assignment/book-shop/avif/the-alchemist.avif",
                "webp": "https://vos.line-scdn.net/assignment/book-shop/webp/the-alchemist.webp"
            }
        },
        { 
            "id": 10014, "title": "Wrinkle in Time", "author": "Madeleine L'Engle", "price": "288.12", "description": "A Wrinkle in Time: The Graphic Novel by Madeleine L'Engle; adapted & illustrated by Hope Larson: A graphic novel adaptation of Madeleine L'Engle's ground-breaking science fiction and fantasy classic.",
            "images": {
                "jpeg": "https://vos.line-scdn.net/assignment/book-shop/jpeg/Wrinkle%20in%20Time.jpeg",
                "avif": "https://vos.line-scdn.net/assignment/book-shop/avif/Wrinkle%20in%20Time.avif",
                "webp": "https://vos.line-scdn.net/assignment/book-shop/webp/Wrinkle%20in%20Time.webp"
            }
        }
    ]
}
